Revit 2024 API
Revision.Create Method
 Creates a new Revision in the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static Revision Create(
	Document document
)
Visual Basic
Public Shared Function Create ( _
	document As Document _
) As Revision
Visual C++
public:
static Revision^ Create(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document of the new Revision.
Return Value
 The newly created Revision.
Remarks
 The new Revision will be added at the end of the sequence of existing Revisions.
Examples
CopyC#
private Revision AddNewRevision(Document document, string description, string issuedBy, string issuedTo, ElementId sequenceNumber, DateTime date)
{
    Revision newRevision = Revision.Create(document);
    newRevision.Description = description;
    newRevision.IssuedBy = issuedBy;
    newRevision.IssuedTo = issuedTo;
    newRevision.RevisionNumberingSequenceId = sequenceNumber;
    newRevision.RevisionDate = date.ToShortDateString();
    return newRevision;
}
CopyVB.NET
Private Function AddNewRevision(document As Document, description As String, issuedBy As String, issuedTo As String, sequenceNumber As ElementId, [date] As DateTime) As Revision
    Dim newRevision As Revision = Revision.Create(document)
    newRevision.Description = description
    newRevision.IssuedBy = issuedBy
    newRevision.IssuedTo = issuedTo
    newRevision.RevisionNumberingSequenceId = sequenceNumber
    newRevision.RevisionDate = [date].ToShortDateString()
    Return newRevision
End Function
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a project document.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Revision Class
Autodesk.Revit.DB Namespace